import java.util.Arrays;
import java.util.List;

public class Alphabet {

    public static final List ALPHABET_RUS = Arrays.asList(
            'а', 'б',
            'в', 'г', 'д', 'е', 'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у',
            'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ю', 'я', '.', ',', '«', '»',
            ':', '!', '?', ' ');
    public static final List<String> POPULAR_PARTS_RUS = Arrays.asList(
            "то", "на", "го", "не", "но", "по", "ра", "ко", "ни", "во", "ка", "ла", "ро", "ли", "ло",               //слоги
            "ре", "та", "ва", "за", "ри", "де", "ве", "те", "да", "ле", "бы", "же", "до", "се", "ти");              //слоги
    public  static final List<String> POPULAR_PARTS_RUS_2 = Arrays.asList(
            "пре","про", "обо", "под", "над", "ото", "бес", "без", "воз", "изо", "наи", "недо", "низ",                       //приставки
            "нис", "обо", "пере", "пре", "при", "раз", "рас", "через", "черес", "вне", "меж", "возле", "сверх",              //приставки
            "около", "противо", "пра", "интер", "инфра", "контр", "пан", "пост", "прото", "суб", "супер", "транс", "ультра", //приставки
            "адь", "ени", "есть", "ость", "изн", "ель", "льник", "льщик", "чик", "ник", "щик", "изм", "ист",                 //суффиксы
            "ств", "чиц", "еват", "оват", "енн", "енск", "инск", "лив", "чив", "ист", "овит", "тельн",                       //суффикцы
            "чат", "ать", "ять", "ова", "чать", "ствов",                                                                     //суффиксы
            "гар", "гор", "зар", "зор", "клан", "клон", "твар", "твор", "плав", "плов", "бир", "бер",                        //корни
            "дир", "дер", "мир", "мер", "тир", "тер", "пир", "пер", "жиг", "жег", "стил", "стел", "блист", "блест",          //корни
            "чит", "чет", "мак", "мок", "моч", "равн", "ровн", "кас", "кос", "лаг", "лож", "раст", "ращ",                    //корни
            "рос", "скак", "скоч",                                                                                           //корни
            "ями", "ому", "ных", "ная", "егу", "том", "его", "ого", "вый", "ный", "кая", "тая",                              //окончания
            "кий", "тый", "кое", "тое", "кой", "той", "ной", "ном", "ком", "том", "ясь", "ась", "ешь", "ете",                //окончания
            "ала", "али", "ать", "ять", "оть", "еть", "уть", "ешь", "ишь", "ите", "яли", "ола", "ела",                       //окончания
            "ула", "ули", "ами", "ешь", "ите",                                                                               //окончания
            "она", "они", "себя", "мой", "твой", "наш", "ваш", "свой", "тот", "такой", "таков",                              //местоимения
            "кто", "что", "какой", "который", "чей", "весь", "всякий", "каждый", "иной", "любой", "сам", "самый",            //местоимения
            "другой", "сколько");
}
